{
  "backend/main.mo": "Motoko canister managing authorization, user profiles, builder assistant sessions, and CRUD for opportunities with sorting utilities.",
  "feature_evidence.json": "Feature evidence report documenting removal of a homepage hero headline and listing affected files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend files including pages, components, hooks, and configs.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode tokens, and global element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the app root and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in ThemeProvider with toaster notifications.",
  "frontend/src/components/AppShell.tsx": "Layout shell providing header with navigation, mobile menu, main content wrapper, and footer.",
  "frontend/src/components/auth/BuilderLoginGate.tsx": "Renders a login screen using Internet Identity with status handling and a call to initiate authentication.",
  "frontend/src/components/BrowseFiltersBar.tsx": "Filter bar component offering controls for location, category, barrier level, and sort mode with clear-all functionality.",
  "frontend/src/components/builder/BuilderShell.tsx": "Layout wrapper combining sidebar sessions, chat transcript, and message composer for the builder UI.",
  "frontend/src/components/builder/ChatComposer.tsx": "Textarea and send button component that submits user messages with validation and loading states.",
  "frontend/src/components/builder/ChatTranscript.tsx": "Scrollable chat view showing user and assistant messages with auto‑scrolling and loading/empty placeholders.",
  "frontend/src/components/builder/ProfileSetupDialog.tsx": "Dialog prompting the user to enter and save their name to create a profile before using the builder.",
  "frontend/src/components/builder/SessionsPanel.tsx": "Lists builder sessions, allows creating new ones, and highlights the active session with loading placeholders.",
  "frontend/src/components/FeaturedOpportunitiesSection.tsx": "Displays featured opportunities with loading, error, and empty states using OpportunityCard components.",
  "frontend/src/components/OpportunityCard.tsx": "Displays an opportunity with badges, score, description, and actions to view details or open an external link.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on identity, auto‑invalidating dependent queries on change.",
  "frontend/src/hooks/useBuilderMessages.ts": "Fetches session messages and provides a mutation to append new messages, invalidating queries on update.",
  "frontend/src/hooks/useBuilderSessions.ts": "Retrieves user sessions and exposes a mutation to create new sessions with automatic query refreshing.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Loads and saves the current user's profile through the actor, managing loading and mutation states.",
  "frontend/src/hooks/useEnsureXerisFeatured.ts": "Ensures a specific featured opportunity exists by calling the backend once and invalidating related queries.",
  "frontend/src/hooks/useFeaturedOpportunities.ts": "Hook using react-query to fetch featured opportunities from the actor when available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication using Dfinity AuthClient, including login state management.",
  "frontend/src/hooks/useOpportunities.ts": "Hook fetching a filtered list of opportunities from the actor with react-query.",
  "frontend/src/hooks/useOpportunity.ts": "Hook fetching a single opportunity by ID via the actor.",
  "frontend/src/hooks/useSubmitOpportunity.ts": "Mutation hook to submit a new opportunity and invalidate related queries.",
  "frontend/src/index.css": "Tailwind base styles with custom color tokens, dark mode values, and utility classes for gradients and text effects.",
  "frontend/src/main.tsx": "App entry wiring ReactDOM, react-query client, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing mission and features with card-based sections.",
  "frontend/src/pages/BrowsePage.tsx": "Browse page with filters, sorting, featured section, and opportunity listing driven by URL search params.",
  "frontend/src/pages/BuilderPage.tsx": "Authenticated builder interface managing sessions, messages, profile setup, and AI-assisted chat workflow.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, feature highlights, and navigation buttons to the builder and browse pages.",
  "frontend/src/pages/OpportunityDetailsPage.tsx": "Displays detailed information for a single opportunity with loading, error, badges, and external link actions.",
  "frontend/src/pages/SubmitOpportunityPage.tsx": "Form page for submitting new opportunities with validation, state management, and submission handling.",
  "frontend/src/utils/builderAssistant.ts": "Rule-based generator that creates deterministic app plans by analyzing prompts for features and app types.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters across routing modes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, typography, animations, and container settings.",
  "project_state.json": "Holds the current project state, including metadata, a rebrand summary, and a list of existing features with IDs, titles, requirements, and versions. Contains no architectural notes or known issues beyond marking the file as a fix request."
}