{
  "backend/main.mo": "Motoko actor implementing user auth, profile management, builder sessions, and opportunity storage with permission checks.",
  "feature_evidence.json": "Feature evidence report mapping product features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of many frontend file paths to concise descriptions of their purpose and functionality.",
  "frontend/index.css": "Tailwind base/theme CSS defining OKLCH color variables, dark mode values, and global background/foreground styles.",
  "frontend/index.html": "Basic HTML shell mounting the root React app and loading the main entry script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, global layout, theme provider, and top-level routes including the builder page.",
  "frontend/src/components/AppShell.tsx": "UI shell with header, navigation (including AI App Builder), mobile menu, and site footer.",
  "frontend/src/components/auth/BuilderLoginGate.tsx": "Displays a login screen using Internet Identity with loading handling and basic feature descriptions.",
  "frontend/src/components/BrowseFiltersBar.tsx": "Filter bar component providing controls for location, category, barrier level, and sort mode with clear-all logic.",
  "frontend/src/components/builder/BuilderShell.tsx": "Provides the main layout shell for the builder, including sessions panel, transcript area, and composer.",
  "frontend/src/components/builder/ChatComposer.tsx": "Text input form for sending builder chat messages with validation and loading states.",
  "frontend/src/components/builder/ChatTranscript.tsx": "Displays chat messages with auto‑scrolling, placeholders, and role‑based message styling.",
  "frontend/src/components/builder/ProfileSetupDialog.tsx": "Modal dialog prompting users to enter and save their profile name on first use.",
  "frontend/src/components/builder/SessionsPanel.tsx": "Sidebar for listing, selecting, and creating builder sessions with loading and empty states.",
  "frontend/src/components/FeaturedOpportunitiesSection.tsx": "Fetches and displays featured opportunities with loading skeletons, error handling, and a grid of OpportunityCard components.",
  "frontend/src/components/OpportunityCard.tsx": "Renders an opportunity card showing metadata, score, description, and links, with optional featured styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBuilderMessages.ts": "Loads and appends builder chat messages for a session using backend actor calls.",
  "frontend/src/hooks/useBuilderSessions.ts": "Fetches and creates user builder sessions, invalidating queries on changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides a React Query hook to load and save the current user's profile via the actor API.",
  "frontend/src/hooks/useEnsureXerisFeatured.ts": "Initializes a featured Xeris opportunity once and invalidates related queries.",
  "frontend/src/hooks/useFeaturedOpportunities.ts": "Fetches a list of featured opportunities from the actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, auth client setup, and login/logout state management.",
  "frontend/src/hooks/useOpportunities.ts": "Loads filtered opportunities from the actor based on remote, category, and barrier values.",
  "frontend/src/hooks/useOpportunity.ts": "Fetches a single opportunity by ID using React Query.",
  "frontend/src/hooks/useSubmitOpportunity.ts": "Provides a mutation to submit a new opportunity and invalidates related opportunity queries.",
  "frontend/src/index.css": "Defines Tailwind base, theme colors, typography, and utility classes including glow and gradient effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details and feature explanations for the platform.",
  "frontend/src/pages/BrowsePage.tsx": "Implements the browse interface with filters, URL sync, featured section, and sorted opportunity listings.",
  "frontend/src/pages/BuilderPage.tsx": "Main builder interface handling authentication, session selection, message flow, and rendering of chat-based app planning UI.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, calls to action, and featured opportunity integration.",
  "frontend/src/pages/OpportunityDetailsPage.tsx": "Loads and displays full details for a specific opportunity with badges, metadata, and error/loading states.",
  "frontend/src/pages/SubmitOpportunityPage.tsx": "Form page for submitting new opportunities with validation, submission handling, and navigation on success.",
  "frontend/src/utils/builderAssistant.ts": "Rule-based generator producing deterministic app plans from user prompts by detecting keywords and features.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind config defining dark mode, content paths, extended theme colors, typography, animations, and plugins.",
  "project_state.json": "Project state metadata describing the app’s current version, goals, and a list of implemented features for the SIDEHUSL rebrand."
}