{
  "backend/main.mo": "Motoko canister implementing authorization, user profiles, builder sessions, and opportunity storage with permission checks.",
  "feature_evidence.json": "Feature evidence report linking a homepage hero text adjustment to its source file and related components.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief descriptions of each component and page.",
  "frontend/index.css": "Global Tailwind base styles defining CSS variables for light and dark themes.",
  "frontend/index.html": "Root HTML document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in ThemeProvider and AppShell.",
  "frontend/src/components/AppShell.tsx": "App layout with header, navigation, mobile menu, and footer wrapping page content.",
  "frontend/src/components/auth/BuilderLoginGate.tsx": "Shows a login screen using Internet Identity with descriptions and a button to authenticate.",
  "frontend/src/components/BrowseFiltersBar.tsx": "Filter bar component providing controls for location, category, barrier level, and sort mode.",
  "frontend/src/components/builder/BuilderShell.tsx": "Provides the main layout for the builder interface, including sessions panel, transcript, and composer areas.",
  "frontend/src/components/builder/ChatComposer.tsx": "Textarea and send button component that handles message submission with validation and loading states.",
  "frontend/src/components/builder/ChatTranscript.tsx": "Renders chat messages with avatars, auto‑scrolling, loading skeletons, and an empty-state prompt.",
  "frontend/src/components/builder/ProfileSetupDialog.tsx": "Dialog prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/builder/SessionsPanel.tsx": "Sidebar listing builder sessions with controls to create and select sessions.",
  "frontend/src/components/FeaturedOpportunitiesSection.tsx": "Displays featured opportunities with loading, error, and empty states using OpportunityCard.",
  "frontend/src/components/OpportunityCard.tsx": "Displays an opportunity card with title, badges, score, and actions to view details or open an external link.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useBuilderMessages.ts": "Fetches and appends builder chat messages for a session using React Query and the backend actor.",
  "frontend/src/hooks/useBuilderSessions.ts": "Loads the user's builder sessions and provides a mutation to create new sessions.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Retrieves and saves the current user's profile via the backend actor with React Query state management.",
  "frontend/src/hooks/useEnsureXerisFeatured.ts": "Ensures a specific featured opportunity exists by calling the backend once and invalidating related queries.",
  "frontend/src/hooks/useFeaturedOpportunities.ts": "Fetches featured opportunities using react-query and an actor instance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity, and status states.",
  "frontend/src/hooks/useOpportunities.ts": "Retrieves filtered opportunities list via react-query with remote, category, and barrier options.",
  "frontend/src/hooks/useOpportunity.ts": "Fetches a single opportunity by ID using the actor and react-query.",
  "frontend/src/hooks/useSubmitOpportunity.ts": "Submits a new opportunity and invalidates related react-query caches on success.",
  "frontend/src/index.css": "Tailwind base configuration with theme variables, dark mode styles, and custom utilities.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details and feature descriptions using styled cards.",
  "frontend/src/pages/BrowsePage.tsx": "Displays browsable opportunities with filters, sorting, featured section, and URL-synced search params.",
  "frontend/src/pages/BuilderPage.tsx": "Manages the builder chat interface with identity gating, session handling, messaging, and profile setup.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights, and navigation buttons for the app builder and browsing opportunities.",
  "frontend/src/pages/OpportunityDetailsPage.tsx": "Displays detailed information about a specific opportunity with loading, error handling, and navigation back to browsing.",
  "frontend/src/pages/SubmitOpportunityPage.tsx": "Form page allowing users to submit a new opportunity with validation, error display, and submission handling.",
  "frontend/src/utils/builderAssistant.ts": "Rule-based generator that creates deterministic app plans by extracting keywords and detecting features from a prompt.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with support for query strings, hash routing, and session persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "JSON describing project metadata, rebrand goals, and a list of existing implemented features with their requirements. Contains no architectural notes or issues."
}