{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, builder sessions with messages, and CRUD logic for ranked opportunities.",
  "feature_evidence.json": "Feature evidence record describing a homepage hero layout change and its associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing styling, routing, pages, components, and data hooks.",
  "frontend/index.css": "Base Tailwind setup defining light/dark theme CSS variables for colors, borders, inputs, charts, and layout tokens.",
  "frontend/index.html": "HTML entry point loading the root React mount node and main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in ThemeProvider and Toaster inside a shared layout.",
  "frontend/src/components/AppShell.tsx": "Responsive shell with sticky header, navigation (including AI App Builder), mobile menu, and footer.",
  "frontend/src/components/auth/BuilderLoginGate.tsx": "Renders a login gate prompting users to authenticate via Internet Identity before accessing the builder.",
  "frontend/src/components/BrowseFiltersBar.tsx": "Filter bar component providing location, category, barrier, and sort controls with clear-all functionality.",
  "frontend/src/components/builder/BuilderShell.tsx": "Provides the layout for the builder interface, including sessions panel, transcript area, and composer.",
  "frontend/src/components/builder/ChatComposer.tsx": "Handles message input and submission for the builder chat, including validation and loading states.",
  "frontend/src/components/builder/ChatTranscript.tsx": "Displays chat messages with auto-scrolling, loading skeletons, and empty-state prompts.",
  "frontend/src/components/builder/ProfileSetupDialog.tsx": "Shows a dialog to collect and save the user's name during initial profile setup.",
  "frontend/src/components/builder/SessionsPanel.tsx": "Lists builder sessions, allows creating new ones, and highlights the active session.",
  "frontend/src/components/FeaturedOpportunitiesSection.tsx": "Loads and displays featured opportunities with loading skeletons, error state, and a grid of cards.",
  "frontend/src/components/OpportunityCard.tsx": "Displays an opportunity card with title, company, badges, score, and action buttons, with optional featured styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBuilderMessages.ts": "Fetches and appends builder chat messages for a given session using the actor API.",
  "frontend/src/hooks/useBuilderSessions.ts": "Loads user builder sessions and provides a mutation to create new sessions.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Retrieves and saves the current user's profile through the actor, managing loading states.",
  "frontend/src/hooks/useEnsureXerisFeatured.ts": "Ensures a specific featured opportunity exists by calling a backend initializer once.",
  "frontend/src/hooks/useFeaturedOpportunities.ts": "Defines a React Query hook that fetches featured opportunities using the actor API when available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook managing login, stored identities, and auth state via AuthClient.",
  "frontend/src/hooks/useOpportunities.ts": "Provides a React Query hook to fetch filtered opportunity lists from the actor API.",
  "frontend/src/hooks/useOpportunity.ts": "Fetches a single opportunity by ID using React Query and the actor API.",
  "frontend/src/hooks/useSubmitOpportunity.ts": "Defines a mutation hook to submit a new opportunity and invalidate related queries on success.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables, typography, and custom utilities like gradients and text glow.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing SIDEHUSL's mission, workflow, and value using styled sections and cards.",
  "frontend/src/pages/BrowsePage.tsx": "Implements the browse page with filters, URL sync, featured section, and sorted opportunity listings.",
  "frontend/src/pages/BuilderPage.tsx": "Implements the authenticated builder interface with sessions, messages, profile setup, and AI-assisted chat.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights, and navigation buttons to builder and browse pages.",
  "frontend/src/pages/OpportunityDetailsPage.tsx": "Displays detailed information for a single opportunity with loading, error handling, and navigation back to browse.",
  "frontend/src/pages/SubmitOpportunityPage.tsx": "Form page allowing users to submit new opportunities with validation and submission via a mutation hook.",
  "frontend/src/utils/builderAssistant.ts": "Rule‑based generator that analyzes a prompt and produces a deterministic app plan with pages, features, and data models.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, fonts, and enabling plugins.",
  "project_state.json": "JSON describing the project’s current state, including version info, a rebrand summary, and a list of existing implemented features. It outlines completed functionality and indicates the project is in a fix-request state."
}