{
  "kind": "build_request",
  "title": "Lower the Home page hero CTA buttons",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "On the Home/Landing page hero (frontend/src/pages/HomePage.tsx), lower the two primary call-to-action buttons (“Open AI App Builder” and “Browse Opportunities”) by adjusting the hero layout spacing so the button row sits further down within the hero area on both mobile and desktop, while keeping all existing hero text, readability overlays, and responsive behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Lower the ,open ai app builder ,and browse opurtunity,  buttons on header page"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page hero, the “Open AI App Builder” and “Browse Opportunities” buttons render noticeably lower than before (increased vertical spacing above the button row) on mobile and desktop breakpoints.",
        "The hero’s supporting paragraph and “AI-Powered App Builder” label remain in the same order and remain readable against the background image due to the existing overlay gradients.",
        "No changes to button text (must remain in English) and both buttons still navigate correctly to /builder and /browse.",
        "No changes are made to the global sticky header navigation (frontend/src/components/AppShell.tsx) as part of this spacing adjustment."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Changing the button labels, routes, or adding/removing hero content.",
    "Redesigning the entire hero section or changing the background image/overlay gradients."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}