{
  "kind": "build_request",
  "title": "Move landing page hero supporting copy to the very top",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "On the landing page hero (frontend/src/pages/HomePage.tsx), move the supporting hero copy paragraph that begins with “Create your own AI-powered web app in minutes. No coding required.” to the very top of the hero content (i.e., it should be the first hero text users see), with spacing adjusted so it sits as high as practical within the hero area on both mobile and desktop while remaining readable and visually balanced.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Move ,\"create your own ai powered webb app in minutes ,nocod9ng etc farther up ,allthe way to the top of landing"
        ]
      },
      "acceptanceCriteria": [
        "In the Home page hero, the supporting paragraph starting with “Create your own AI-powered web app in minutes. No coding required.” appears above the “AI-Powered App Builder” label (and above the CTA buttons).",
        "The hero content layout is adjusted (e.g., padding/margins/vertical alignment) so this paragraph is positioned at the top of the hero content area rather than centered, especially on mobile.",
        "The existing hero overlay/gradients remain in place and the paragraph remains readable over the background image in both light and dark themes.",
        "No user-facing copy in that paragraph is changed (English text remains exactly as currently shown).",
        "The CTA buttons and their routes remain unchanged and continue to render correctly across responsive breakpoints."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files in frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep changes scoped to the landing page hero layout (frontend/src/pages/HomePage.tsx); do not alter backend behavior.",
    "Do not introduce any external AI services or new dependencies."
  ],
  "nonGoals": [
    "Changing the wording of the hero supporting paragraph.",
    "Changing the background hero image or generating new assets.",
    "Modifying global navigation, routing, or CTA destinations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}